<a href="https://colab.research.google.com/github/allenalvin333/College7/blob/master/T1/T1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Allen Ben Philipose** - 18BIS0043
# **Lab Task - 1, Submitted to: Dr. Sankar Ganesh S**

## Example

In [ ]:
dataset = pd.read_csv('sample_data.csv')
print(dataset)

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Nigeria  18.0  15000.0        No
5   Germany  40.0      NaN       Yes
6    France  35.0  58000.0       Yes
7     Spain   NaN  52000.0        No
8    France  48.0  79000.0       Yes
9   Germany  50.0  83000.0        No
10   France  37.0  67000.0       Yes
11  Nigeria  50.0  60000.0       Yes
12   France  22.0  30000.0        No
13      NaN  44.0  45000.0       Yes
14   France  47.0  78000.0       NaN
15  Nigeria  35.0  43000.0       Yes
16    Spain  34.0  44000.0       Yes
17    Spain  27.0  48000.0       Yes
18    Spain  33.0  48000.0       Yes
19  Nigeria  29.0  77000.0       Yes
20    Spain   NaN  57000.0       Yes
21   France  44.0  48000.0       Yes
22  Germany  50.0  83000.0        No
23   France  37.0  67000.0       Yes
24   France  37.0  23000.0       Yes
25  Germany  45.0  50000.0        No
26   France  37.0  67000.0       Yes
27  Nigeria  30.0  30000.0       Yes
28  Nigeria  29.0  15000.0        No

In [ ]:
dataset = dataset.drop_duplicates()
print(dataset)

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Nigeria  18.0  15000.0        No
5   Germany  40.0      NaN       Yes
6    France  35.0  58000.0       Yes
7     Spain   NaN  52000.0        No
8    France  48.0  79000.0       Yes
9   Germany  50.0  83000.0        No
10   France  37.0  67000.0       Yes
11  Nigeria  50.0  60000.0       Yes
12   France  22.0  30000.0        No
13      NaN  44.0  45000.0       Yes
14   France  47.0  78000.0       NaN
15  Nigeria  35.0  43000.0       Yes
16    Spain  34.0  44000.0       Yes
18    Spain  33.0  48000.0       Yes
19  Nigeria  29.0  77000.0       Yes
20    Spain   NaN  57000.0       Yes
21   France  44.0  48000.0       Yes
24   France  37.0  23000.0       Yes
25  Germany  45.0  50000.0        No
27  Nigeria  30.0  30000.0       Yes
28  Nigeria  29.0  15000.0        No

# **0. Initialization**

In [1]:
from google.colab import drive
drive.mount("/content/gdrive")

Mounted at /content/gdrive

In [2]:
!cp -r /content/gdrive/MyDrive/Academic/Labs/ML/T1 /content/

In [3]:
import warnings
warnings.filterwarnings("ignore")

In [4]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import LabelBinarizer

# **1. Dealing with Missing Values**

## References
- https://www.kaggle.com/dansbecker/handling-missing-values
- https://towardsdatascience.com/how-to-deal-with-missing-data-in-python-1f74a9112d93
- https://medium.com/x8-the-ai-community/handling-missing-values-in-data-54e1dc77e24f

## Dataset
- https://www.kaggle.com/dansbecker/melbourne-housing-snapshot/home?select=melb_data.csv

## Explanation
*A common occurrence in a data-set is missing values. This can happen due to multiple reasons like unrecorded observations or data corruption. Pandas library provides a variety of functions for marking these corrupt values. We will study how we can remove or impute these values. There are many ways data can end up with missing values.*
- *A 2 bedroom house wouldn't include an answer for How large is the third bedroom*
- *Someone being surveyed may choose not to share their income*

*Python libraries represent missing numbers as nan which is short for "not a number". Most libraries (including scikit-learn) will give you an error if you try to build a model using data with missing values.*
- *A Simple Option: **Drop Columns with Missing Values** - 
In many cases, you'll have both a training dataset and a test dataset. You will want to drop the same columns in both DataFrames*
- *A Better Option: **Imputation** - Imputation fills in the missing value with some number. The imputed value won't be exactly right in most cases, but it usually gives more accurate models than dropping the column entirely. The default behavior fills in the mean value for imputation. Statisticians have researched more complex strategies, but those complex strategies typically give no benefit once you plug the results into sophisticated machine learning models.*

## **Sample Program**

#### Dataset Inspection

#### **Drop Columns**

#### **Imputation**

# **2. Handling categorical data**

## References
- https://pbpython.com/categorical-encoding.html
- https://analyticsindiamag.com/complete-guide-to-handling-categorical-data-using-scikit-learn/
- https://towardsdatascience.com/handling-categorical-data-the-right-way-9d1279956fc6

## Dataset
- https://www.kaggle.com/dansbecker/melbourne-housing-snapshot/home?select=melb_data.csv

## Explanation

*Categorical features have a lot to say about the dataset thus it should be converted to numerical to make it into a machine-readable format. Focusing only on numerical variables in the dataset isn’t enough to get good accuracy. Often categorical variables prove to be the most important factor and thus identify them. In many practical Data Science activities, the data set will contain categorical variables.*

*These variables are typically stored as text values which represent various traits. Some examples include color (“Red”, “Yellow”, “Blue”), size (“Small”, “Medium”, “Large”) or geographic designations (State or Country). Regardless of what the value is used for, the challenge is determining how to use this data in the analysis. Many machine learning algorithms can support categorical values without further manipulation but there are many more algorithms that do not. Therefore, the analyst is faced with the challenge of figuring out how to turn these text attributes into numerical values for further processing.*

*Currently, many resources advertise a wide variety of solutions that might seem to work at first, but are deeply wrong once thought through. This is especially true for non-ordinal categorical data, meaning that the classes are not ordered (As it might be for Good=0, Better=1, Best=2). A bit of clarity is needed to distinguish the approaches that Data Scientists should use from those that simply make the models run.*

*Two major types of categorical features are:*
- *Nominal – These are variables which are not related to each other in any order such as colour (black, blue, green).*
- *Ordinal – These are variables where a certain order can be found between them such as student grades (A, B, C, D, Fail).*

## **Sample Program**

#### Dataset Inspection

In [ ]:
df2 = pd.read_csv('/content/T1/2.csv')

In [ ]:
df2.head()

       Suburb           Address  ...             Regionname Propertycount
0  Abbotsford      85 Turner St  ...  Northern Metropolitan        4019.0
1  Abbotsford   25 Bloomburg St  ...  Northern Metropolitan        4019.0
2  Abbotsford      5 Charles St  ...  Northern Metropolitan        4019.0
3  Abbotsford  40 Federation La  ...  Northern Metropolitan        4019.0
4  Abbotsford       55a Park St  ...  Northern Metropolitan        4019.0

[5 rows x 21 columns]

In [ ]:
df2.describe()

              Rooms         Price  ...    Longtitude  Propertycount
count  13580.000000  1.358000e+04  ...  13580.000000   13580.000000
mean       2.937997  1.075684e+06  ...    144.995216    7454.417378
std        0.955748  6.393107e+05  ...      0.103916    4378.581772
min        1.000000  8.500000e+04  ...    144.431810     249.000000
25%        2.000000  6.500000e+05  ...    144.929600    4380.000000
50%        3.000000  9.030000e+05  ...    145.000100    6555.000000
75%        3.000000  1.330000e+06  ...    145.058305   10331.000000
max       10.000000  9.000000e+06  ...    145.526350   21650.000000

[8 rows x 13 columns]

In [ ]:
df2.info

<bound method DataFrame.info of               Suburb  ... Propertycount
0         Abbotsford  ...        4019.0
1         Abbotsford  ...        4019.0
2         Abbotsford  ...        4019.0
3         Abbotsford  ...        4019.0
4         Abbotsford  ...        4019.0
...              ...  ...           ...
13575  Wheelers Hill  ...        7392.0
13576   Williamstown  ...        6380.0
13577   Williamstown  ...        6380.0
13578   Williamstown  ...        6380.0
13579     Yarraville  ...        6543.0

[13580 rows x 21 columns]>

In [ ]:
s2 = (df2.dtypes=='object')
o2 = list(s2[s2].index)
print(o2)

['Suburb', 'Address', 'Type', 'Method', 'SellerG', 'Date', 'CouncilArea', 'Regionname']

In [ ]:
features2 = df2[['Type','Method','Regionname']]
features2.head()

  Type Method             Regionname
0    h      S  Northern Metropolitan
1    h      S  Northern Metropolitan
2    h     SP  Northern Metropolitan
3    h     PI  Northern Metropolitan
4    h     VB  Northern Metropolitan

In [ ]:
features2.describe()

         Type Method             Regionname
count   13580  13580                  13580
unique      3      5                      8
top         h      S  Southern Metropolitan
freq     9449   9022                   4695

In [ ]:
features2.Regionname.value_counts()

Southern Metropolitan         4695
Northern Metropolitan         3890
Western Metropolitan          2948
Eastern Metropolitan          1471
South-Eastern Metropolitan     450
Eastern Victoria                53
Northern Victoria               41
Western Victoria                32
Name: Regionname, dtype: int64

In [ ]:
features2.Type.value_counts()

h    9449
u    3017
t    1114
Name: Type, dtype: int64

In [ ]:
features2.Method.value_counts()

S     9022
SP    1703
PI    1564
VB    1199
SA      92
Name: Method, dtype: int64

#### **Label Encoding**

In [ ]:
le21 = LabelEncoder()
df21 = features2[['Regionname']]
df21['Region'] = le21.fit_transform(features2['Regionname'])
df21.value_counts()

Regionname                  Region
Southern Metropolitan       5         4695
Northern Metropolitan       2         3890
Western Metropolitan        6         2948
Eastern Metropolitan        0         1471
South-Eastern Metropolitan  4          450
Eastern Victoria            1           53
Northern Victoria           3           41
Western Victoria            7           32
dtype: int64

In [ ]:
le22 = LabelEncoder()
df22 = features2[['Type']]
df22['Type'] = le22.fit_transform(features2['Type'])
df22.value_counts()

Type
0       9449
2       3017
1       1114
dtype: int64

In [ ]:
le23 = LabelEncoder()
df23 = features2[['Method']]
df23['Method'] = le23.fit_transform(features2['Method'])
df23.value_counts()

Method
1         9022
3         1703
0         1564
4         1199
2           92
dtype: int64

#### **One Hot Encoding**

In [ ]:
df24 = pd.get_dummies(features2['Regionname'])
df24.value_counts()

Eastern Metropolitan  Eastern Victoria  Northern Metropolitan  Northern Victoria  South-Eastern Metropolitan  Southern Metropolitan  Western Metropolitan  Western Victoria
0                     0                 0                      0                  0                           1                      0                     0                   4695
                                        1                      0                  0                           0                      0                     0                   3890
                                        0                      0                  0                           0                      1                     0                   2948
1                     0                 0                      0                  0                           0                      0                     0                   1471
0                     0                 0                      0                  1                           0                      0                     0                    450
                      1                 0                      0                  0                           0                      0                     0                     53
                      0                 0                      1                  0                           0                      0                     0                     41
                                                               0                  0                           0                      0                     1                     32
dtype: int64

In [ ]:
df25 = pd.get_dummies(features2['Type'])
df25.value_counts()

h  t  u
1  0  0    9449
0  0  1    3017
   1  0    1114
dtype: int64

In [ ]:
df26 = pd.get_dummies(features2['Method'])
df26.value_counts()

PI  S  SA  SP  VB
0   1  0   0   0     9022
    0  0   1   0     1703
1   0  0   0   0     1564
0   0  0   0   1     1199
       1   0   0       92
dtype: int64

#### **Label Binarizer**

In [ ]:
lb21 = LabelBinarizer()
lb24 = lb21.fit_transform(features2["Regionname"])
pd.DataFrame(lb24, columns=lb21.classes_).value_counts()

Eastern Metropolitan  Eastern Victoria  Northern Metropolitan  Northern Victoria  South-Eastern Metropolitan  Southern Metropolitan  Western Metropolitan  Western Victoria
0                     0                 0                      0                  0                           1                      0                     0                   4695
                                        1                      0                  0                           0                      0                     0                   3890
                                        0                      0                  0                           0                      1                     0                   2948
1                     0                 0                      0                  0                           0                      0                     0                   1471
0                     0                 0                      0                  1                           0                      0                     0                    450
                      1                 0                      0                  0                           0                      0                     0                     53
                      0                 0                      1                  0                           0                      0                     0                     41
                                                               0                  0                           0                      0                     1                     32
dtype: int64

In [ ]:
lb22 = LabelBinarizer()
lb25 = lb22.fit_transform(features2["Type"])
pd.DataFrame(lb25, columns=lb22.classes_).value_counts()

h  t  u
1  0  0    9449
0  0  1    3017
   1  0    1114
dtype: int64

In [ ]:
lb23 = LabelBinarizer()
lb26 = lb23.fit_transform(features2["Method"])
pd.DataFrame(lb26, columns=lb23.classes_).value_counts()

PI  S  SA  SP  VB
0   1  0   0   0     9022
    0  0   1   0     1703
1   0  0   0   0     1564
0   0  0   0   1     1199
       1   0   0       92
dtype: int64

# **3. Dealing with inconsistent data entry**

# **4.	Handling Dates and Times**

# **5. Scaling and Normalization**